Public Attributes | List of all members
API_LibPart Struct Reference
Library Part Management
Definition of a Library Part. More...
#include <APIdefs_LibraryParts.h>
 Public Attributes
API_LibTypeID  | typeID
Type of the Library Part.
Int32  | index
Index of the Library Part, contains the current database index of the given Library Part. Note that this number is not constant for a particular Library Part through the whole life of the project.
GS::uchar_t  | docu_UName [API_UniLongNameLen]
Unique document name of the Library Part. If more than one Library Part has the same name, only the newest one is registered. Refer to the ACAPI_LibraryManagement_OverwriteLibPart function to modify this behavior.
GS::uchar_t  | file_UName [API_UniLongNameLen]
File name of the Library Part.
bool  | missingDef
The definition is missing.
bool  | isTemplate
Tells whether this library part is a template.
bool  | isPlaceable
Tells whether this library part can be placed.
GSType  | ownerID
Signature of the owner; used by external objects;.
short  | version
Library Part version.
unsigned short  | platformSign
Library Part platform.
IO::Location *  | location
Location of the library part (GSM) file in the file system.
char  | ownUnID [128]
The unique ID string of the library part.
char  | parentUnID [128]
the unique ID string of the ancestor library part.
Detailed Description
Definition of a Library Part.
Remarks
This structure is definition of the library part. Note, that it is strongly advised to define the file and document name to the same one, because of the Windows/Mac compatibility. The document name terminology was introduced when the Windows platform restricted the filenames to be in 8.3 form. Do not forget to delete the dynamically allocated location pointer after library part operations.
Member Data Documentation
◆ docu_UName
 API_LibPart::docu_UName
Unique document name of the Library Part. If more than one Library Part has the same name, only the newest one is registered. Refer to the ACAPI_LibraryManagement_OverwriteLibPart function to modify this behavior.
◆ file_UName
 API_LibPart::file_UName
File name of the Library Part.
◆ index
 API_LibPart::index
Index of the Library Part, contains the current database index of the given Library Part. Note that this number is not constant for a particular Library Part through the whole life of the project.
◆ isPlaceable
 API_LibPart::isPlaceable
Tells whether this library part can be placed.
◆ isTemplate
 API_LibPart::isTemplate
Tells whether this library part is a template.
◆ location
 API_LibPart::location
Location of the library part (GSM) file in the file system.
◆ missingDef
 API_LibPart::missingDef
The definition is missing.
◆ ownerID
 API_LibPart::ownerID
Signature of the owner; used by external objects;.
◆ ownUnID
 API_LibPart::ownUnID
The unique ID string of the library part.
◆ parentUnID
 API_LibPart::parentUnID
the unique ID string of the ancestor library part.
◆ platformSign
 API_LibPart::platformSign
Library Part platform.
◆ typeID
 API_LibPart::typeID
Type of the Library Part.
◆ version
 API_LibPart::version
Library Part version.